In [1]:
import pandas as pd
import numpy as np

In [18]:
jobs = pd.read_csv("Cleaned_Dataset.csv")

In [19]:
jobs2 = pd.read_csv("Raw_Dataset.csv")

In [29]:
jobs.head()

,company,company score,job title,location,date,salary,skills
0,razorpoint,3.4,junior data scientist,"manchester, england",3d,£35k (employer est.),"data mining, big data, r, data analysis skills..."
1,tower hamlets,3.7,assistant data scientist (graduate) | r-2375,"london, england",5d,£31.00 per hour (employer est.),"r, sql, javascript, python"
2,tw,4.0,data scientist,"nottingham, england",30d+,£50k - £65k (employer est.),"sql, maths, data science, python"
3,natwest group,4.6,data scientist,"edinburgh, scotland",2d,£41k - £54k (glassdoor est.),"software deployment, data analysis skills, sta..."
4,iwoca,3.9,data scientist - ops,"london, england",7d,£60k - £90k (employer est.),"matlab, r, maths, c, machine learning"

In [32]:
# lower all column names
jobs.columns = jobs.columns.str.lower()

In [33]:
# lower all text in dataframe
jobs = jobs.applymap(lambda x: x.lower() if isinstance(x, str) else x)

In [ ]:
# new column to convert to aud
jobs["aud_salary"] = jobs["salary"]*1.97

In [34]:
jobs.head()

,company,company score,job title,date,salary,skills,estimation type,remote,city,country,aud_salary
0,razorpoint,3.4,junior data scientist,3.0,35000.0,"data mining, big data, r, data analysis skills...",employer est.,onsite,manchester,england,68950.0
1,tower hamlets,3.7,assistant data scientist (graduate) | r-2375,5.0,64480.0,"r, sql, javascript, python",employer est.,onsite,london,england,127025.6
2,tw,4.0,data scientist,31.0,57500.0,"sql, maths, data science, python",employer est.,onsite,nottingham,england,113275.0
3,natwest group,4.6,data scientist,2.0,47500.0,"software deployment, data analysis skills, sta...",glasdoor est.,onsite,edinburgh,scotland,93575.0
4,iwoca,3.9,data scientist - ops,7.0,75000.0,"matlab, r, maths, c, machine learning",employer est.,onsite,london,england,147750.0

Questions:
1. Which company is hiring the most individuals?
2. What is the max/min/average/median Salary?

##### 1. Jobs Salary description

In [54]:
jobs['salary'].describe()

count       635.000000
mean      65487.181102
std       22964.437740
min       24500.000000
25%       49250.000000
50%       63000.000000
75%       76250.000000
max      200000.000000
Name: salary, dtype: float64

In [53]:
jobs['aud_salary'].describe()
# Salary seems relatively similar to AUS

count       635.000000
mean     129009.746772
std       45239.942348
min       48265.000000
25%       97022.500000
50%      124110.000000
75%      150212.500000
max      394000.000000
Name: aud_salary, dtype: float64

##### 2. Companies recruiting

In [40]:
jobs["company"].nunique() # 413 unique companies are recruiting for these roles...

413

In [48]:
jobs["company"].value_counts() # Top 2 recruiting businesses are banks and this is followed by a wave of tech...

jpmorgan chase & co    12
capgemini invent       11
meta                   10
spotify                 8
instadeep               8
                       ..
coinbase                1
sidetrade               1
fm conway               1
the rank group          1
cyclotron, inc.         1
Name: company, Length: 413, dtype: int64

##### 3. Job Locations

In [47]:
# Count of job location types (Remote vs Onsite)
jobs["remote"].value_counts()
# Most jobs seem to be moving to onsite as of recently...

onsite    596
remote     39
Name: remote, dtype: int64

In [55]:
jobs["city"].value_counts() # London by far the top employer with 362...

london                  362
manchester               28
cambridge                16
bristol                  14
edinburgh                 9
                       ...
sevenoaks                 1
kingston upon thames      1
loughborough              1
sedgefield                1
sonning                   1
Name: city, Length: 77, dtype: int64